//        Создать класс Автомобиль (англ. Car ), с полями “Год выпуска”, “Цвет”, “Модель”.
//        Создать get и set методы для каждого поля. Создать экземпляр класса Автомобиль,
//        задать сеттером каждое поле, вывести в консоль значение каждого поля геттером.
//        Созданный вами класс должен отвечать принципам инкапсуляции.

package day5;

public class task1 {
        public static class Car{
                int year;
                String color;
                String model;

        }
}
